window.onload=function(){
			createText(1);
		}
		function createText(length){
			var text=" ";
			var textLength= parseInt(length);
			var checkText=document.getElementById("checkText")
	
		var text1=new Array('千军万马','安居乐业','东山再起','一事无成','一心一意','春暖花去','鸟语花香','山清水秀','水深火热','天罗地网',
		'助人为乐','人来人往','人山人海','十全十美','诗情画意','井井有条','乐极生悲','百发百中','无力回天','坐井观天',
		'顶天立地','青山绿水','一表人才','非亲非故','美中不足','火烧眉毛','答非所问','先来后到','名胜古迹','画龙点睛',
		'川流不息','井底之蛙','惊涛骇浪','一鸣惊人','单刀直入','不约而同','雨过天晴','脱口而出','出尔反尔','漫不经心',
		'日积月累','另眼相看','举世闻名','四海为家','大题小做','轰轰烈烈','弱肉强食','九牛一毛','指手画脚','七上八下',
		'天高云淡','千家万户','自始至终','鹅毛大雪','千秋万代','大显身手','无边无际','天寒地冻','省吃俭用','焦头烂额',
		'枝繁叶茂','刨根问底','狐假虎威','乘风破浪','口是心非','异想天开','无价之宝','不知所措','亭亭玉立','专心致志',
		'东张西望','一筹莫展','若隐若现','哭笑不得','全神贯注','得意洋洋','屈指可数','生机勃勃','目瞪口呆','梦寐以求',
		'名列前茅','窃窃私语','数不胜数','无家可归','价值连城','同生共死','半信半疑','振奋人心','大雪纷飞','愁眉苦脸',
		'自作自受','千方百计','偷天换日','两小无猜','指鹿为马','悬梁刺股','四面楚歌','空穴来风','肝胆相照','无忧无虑',
		'随遇而安','春意盎然','左右为难','一叶知秋','不可思议','杯水车薪','中流砥柱','潜移默化','无独有偶','心照不宣',
		'势不两立','围魏救赵','多多益善','约法三章','滔滔不绝','义无反顾','自强不息','所向披靡','精益求精','循规蹈矩',
		'望尘莫及','风起云涌','浩浩荡荡','金碧辉煌','茅塞顿开','载歌载舞','万籁俱寂','责无旁贷','重见天日','锦上添花',
		'历历在目','诲人不倦','天府之国','呕心沥血','全力以赴','君子之交','若无其事','从容不迫','模棱两可','不速之客',
		'一览无余','以德报怨','怨天尤人','因材施教','争先恐后','腾云驾雾','孤芳自赏','勤能补拙','焕然一新','惴惴不安',
		'前仆后继','声东击西','赏心悦目','眉清目秀','耳熟能详','披星戴月','夜以继日','崇山峻岭','跃跃欲试','继往开来',
		'俗不可耐','适得其反','愚不可及','狼吞虎咽','浩如烟海','灯红酒绿','固若鸡汤','出其不意','义不容辞','雅俗共赏',
		'吉祥如意','举世无双','应不暇接','默默无闻','神出鬼没','如出一辙','知己知彼','心悦诚服','息息相关','街头巷尾',
	  '背道而驰','才华横溢','碌碌无为','适可而止','文质彬彬','孤注一掷','临渊羡鱼','弄巧成拙','悬崖勒马','老当益壮',
	  '坚忍不拔','每况愈下','突如其来','稍纵即逝','轻而易举','波光粼粼','浑然天成','绝无仅有','撕心裂肺','有机可乘',
		'阴差阳错','扶老携幼','与日俱增','泰然自若','负隅顽抗','两袖清风','人才济济','一意孤行','波澜壮阔','不三不四',
		'空空如也','衣衫褴褛','置之度外','无坚不摧','筋疲力尽','恩将仇报','旁门左道','如虎添翼','攻其不备','大言不惭',
		'博采众长','穷途末路','死皮赖脸','横冲直撞','交相辉映','水泄不通','博大精深','面不改色','死去活来','富丽堂皇',
		'悠然自得','偷梁换柱','荣华富贵','遍体鳞伤','决胜千里','惊世骇俗','热泪盈眶','寄人篱下','博览群书','天长地久',
		'千篇一律','欣喜若狂','出乎意料','拨云见日','理所当然','不折不扣','倾盆大雨','心烦意乱','千姿百态','百战百胜',
	  '和睦相处','粉身碎骨','肝脑涂地','丰富多彩','坚定不移','国泰民安','固步自封','一技之长','七零八落','死有余辜');
		for (var i=0; i<textLength;i++){
			var charNum=Math.floor(Math.random()*260);
			text+=text1[charNum];
		}
		if(checkText){
			checkText.className="text";
			checkText.innerHTML=text;
		}
			}